stress.yml
config:
  target: 'http://127.0.0.1:3001'
  phases:
    - duration: 20
      arrivalRate: 10
      rampTo: 15
      name: "10 => 15"

    - duration: 20
      arrivalRate: 15
      rampTo: 25
      name: "15 => 25"

    - duration: 90
      arrivalRate: 25
      rampTo: 40
      name: "25 => 40 [MAXIMUM]"
scenarios:
  - flow:
    - get:
        url: "/api/products/{{$randomNumber(1,10000000)}}"
    - put:
        url: "/api/products/{{$randomNumber(1,10000000)}}"
        json:
          review_count: "{{$randomNumber(1,100)}}"
    - post:
        url: "/api/products"
        json:
          unique_id: "{{$randomNumber(1,10000000)}}"
          name: "Sample Name"
          slug: "Temp Slug"
          category: "category"
          manufacturer: "manufacturer"
          primary_image: "primaryimage"
          review_one_star_count: 1
          review_two_star_count: 1
          review_three_star_count: 1 
          review_four_star_count: 1
          review_five_star_count: 1
          review_count: 1
          question_count: 1
          price: 1
          total_price: 1
          stock: 1
          is_prime: false
          description: "description"